{
  "basics": {
    "name": "Samuel Wibrow",
    "label": "Senior Site Reliability Engineer / Platform Engineer",
    "summary": "Highly driven and experienced Site Reliability Engineer with 13+ years designing and operating highly available, scalable infrastructure. Expertise in AWS, Kubernetes, networking, and building internal developer platforms that enable teams to move fast while maintaining reliability.",
    "location": {
      "city": "Zurich",
      "countryCode": "CH"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "swibrow",
        "url": "https://github.com/swibrow"
      },
      {
        "network": "LinkedIn",
        "username": "samuelwibrow",
        "url": "https://www.linkedin.com/in/samuelwibrow/"
      }
    ]
  },
  "work": [
    {
      "company": "Tamedia",
      "location": "Zurich, Switzerland",
      "position": "Site Reliability Engineer",
      "startDate": "2023-08",
      "highlights": [
        "Migrated from Cluster Autoscaler to Karpenter and transitioned all environments to spot instances, reducing EC2 costs by 50%.",
        "Led the migration from CircleCI to GitHub Actions, implementing a centrally managed workflows library for standardised CI/CD across teams.",
        "Improved developer experience by centralising Renovate management, enabling automated dependency updates across the organisation.",
        "Unified AWS infrastructure by implementing stack-based architecture with clear lifecycle separation, reducing Terraform workflow times and improving reliability.",
        "Implemented Datadog Operator to shift observability ownership to developers, improving monitoring coverage and incident response.",
        "Migrated from Terraform managed application deployments to ArgoCD, enabling GitOps workflows and self-service deployments.",
        "Coached the team on focusing on quality engineering practices rather than rushing through tasks."
      ]
    },
    {
      "company": "Dock Financial",
      "location": "Munich, Germany",
      "position": "Platform Engineer",
      "startDate": "2022-07",
      "endDate": "2023-07",
      "highlights": [
        "Architected secure banking infrastructure on AWS using Kubernetes and cloud-native technologies, meeting strict compliance requirements.",
        "Developed comprehensive Helm charts for packaging and deploying complex microservices across multiple environments.",
        "Optimised GitLab CI pipelines, reducing build times by over 50% and improving deployment reliability.",
        "Implemented infrastructure as code using Terraform and Terragrunt for consistent and repeatable deployments.",
        "Established security best practices including secrets management with Vault and automated secret rotation."
      ]
    },
    {
      "company": "Stylight",
      "location": "Munich, Germany",
      "position": "Cloud Engineer",
      "startDate": "2018-05",
      "endDate": "2022-06",
      "highlights": [
        "Led migration from self-managed KOPS to AWS EKS, reducing operational overhead and enabling team autonomy for cluster management.",
        "Built automated multi-region VPC connectivity solution, enabling rapid provisioning of ephemeral test environments.",
        "Migrated core applications serving millions of users monthly to Kubernetes, improving scalability and reducing deployment times by 70%.",
        "Implemented centralised EFK logging stack processing 1TB+ daily, providing real-time insights and reducing incident resolution time.",
        "Standardised CI/CD pipelines across 5+ teams, introducing shared libraries and best practices for consistent deployments.",
        "Developed internal Python library (Troposphere based) for CloudFormation generation, adopted by all teams."
      ]
    },
    {
      "company": "Stylight",
      "position": "Lead Technical Infrastructure",
      "startDate": "2017-04",
      "endDate": "2018-05",
      "highlights": [
        "Led a cloud first approach, successfully integrating cloud-based services into the organisation's infrastructure.",
        "Automated employee user lifecycle management, streamlining user provisioning and management by implementing an event driven architecture.",
        "Managed the IT budget, ensuring that resources were allocated efficiently and cost-effectively.",
        "Managed recruitment, successfully building and managing a team of skilled professionals to support the organisation's technology needs."
      ]
    },
    {
      "company": "Stylight",
      "position": "System Administrator",
      "startDate": "2015-11",
      "endDate": "2017-03",
      "highlights": [
        "Implemented desktop and server standard operating environments and automated the deployment with Windows/OSX/Linux deployment servers.",
        "Successfully deployed highly available services on AWS, including Active Directory, Network and FileServer services, to improve system reliability and performance.",
        "Administered network infrastructure, including firewalls, routers, switches, and VPNs, to ensure secure and efficient network operations.",
        "Deployed a high-density wireless network across the company's office, removing the need for any wired connections."
      ]
    },
    {
      "company": "Public Trustee of Queensland",
      "location": "Brisbane, Australia",
      "position": "System Administrator",
      "startDate": "2014-02",
      "endDate": "2015-04",
      "summary": "Played a key role in managing the Public Trustee's IT infrastructure, which included desktops, servers, and network devices. My primary responsibility was overseeing over 700 workstations across multiple locations."
    },
    {
      "company": "Davichi Computer Services",
      "location": "Brisbane, Australia",
      "position": "System Administrator",
      "startDate": "2012-06",
      "endDate": "2013-08",
      "summary": "Designed and implemented comprehensive IT solutions for over 300 clients, encompassing server hardware configurations, operating system deployments, network service setups, and disaster recovery plans. These solutions were tailored for both data centre and on-premises environments."
    },
    {
      "company": "Best Practice Australia",
      "location": "Brisbane, Australia",
      "position": "System Administrator",
      "startDate": "2010-06",
      "endDate": "2012-04",
      "summary": "Successfully transitioned the company's on-site, unmanaged IT infrastructure to data centre-hosted servers, significantly enhancing system reliability."
    },
    {
      "company": "Apple",
      "location": "Brisbane, Australia",
      "position": "Customer Support",
      "startDate": "2009-01",
      "endDate": "2010-05",
      "summary": "Provided technical support to Apple customers across Australia and New Zealand in a high-volume call centre. Effectively resolved hardware and software issues, demonstrated strong problem-solving skills, and delivered excellent customer service, contributing to high customer satisfaction rates."
    }
  ],
  "education": [
    {
      "institution": "TAFE QLD",
      "area": "Information Technology - Networking",
      "studyType": "Diploma",
      "startDate": "2005",
      "endDate": "2006"
    }
  ],
  "certificates": [
    {
      "name": "Platform Engineering Fundamentals",
      "date": "2024",
      "url": "https://shortly.wibrow.net/0zjvu"
    },
    {
      "name": "Terraform Infrastructure Automation - Associate",
      "date": "2023",
      "url": "https://shortly.wibrow.net/p6oyw"
    },
    {
      "name": "AWS Certified Solutions Architect - Associate",
      "date": "2022",
      "url": "https://shortly.wibrow.net/1jyy7"
    },
    {
      "name": "Microsoft Certified Professional - Installing and Configuring Windows Server 2012",
      "date": "2015",
      "url": "https://shortly.wibrow.net/70aqy"
    }
  ],
  "skills": [
    {
      "name": "Platform & Orchestration",
      "keywords": [
        "Kubernetes",
        "AWS EKS",
        "Karpenter",
        "Helm",
        "Kustomize",
        "AWS ECS"
      ]
    },
    {
      "name": "Cloud & Infrastructure",
      "keywords": [
        "AWS (10 years)",
        "Terraform",
        "CloudFormation",
        "CDK (basic)",
        "GCP (basic)"
      ]
    },
    {
      "name": "Observability",
      "keywords": [
        "Datadog",
        "Prometheus Stack",
        "LGTM Stack",
        "EFK Stack",
        "AWS"
      ]
    },
    {
      "name": "Languages",
      "keywords": [
        "Python",
        "Bash",
        "PowerShell",
        "Go (basic)"
      ]
    },
    {
      "name": "CI/CD & GitOps",
      "keywords": [
        "GitHub Actions",
        "GitLab CI",
        "Flux",
        "ArgoCD",
        "CircleCI"
      ]
    },
    {
      "name": "Networking & Security",
      "keywords": [
        "TCP/IP",
        "DNS",
        "VPN",
        "OAuth2/OIDC",
        "Hashicorp Vault",
        "Secrets Operator"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "Git",
        "Linux",
        "Docker",
        "Many CNCF projects"
      ]
    }
  ]
}